7767517
140 144
Input            rgb_inputs               0 1 rgb_inputs
Input            depth_inputs             0 1 depth_inputs
Convolution      Conv_0                   1 1 depth_inputs 298 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576
ReLU             Relu_2                   1 1 298 300
ConvolutionDepthWise Conv_3                   1 1 300 301 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      Conv_4                   1 1 301 302 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_6                   1 1 302 304
Split            splitncnn_0              1 2 304 304_splitncnn_0 304_splitncnn_1
Pooling          MaxPool_7                1 1 304_splitncnn_1 305 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_8                   1 1 305 306 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      Conv_9                   1 1 306 307 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             Relu_11                  1 1 307 309
ConvolutionDepthWise Conv_12                  1 1 309 310 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Convolution      Conv_13                  1 1 310 311 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_15                  1 1 311 313
Split            splitncnn_1              1 2 313 313_splitncnn_0 313_splitncnn_1
Pooling          MaxPool_16               1 1 313_splitncnn_1 314 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_17                  1 1 314 315 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Convolution      Conv_18                  1 1 315 316 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             Relu_20                  1 1 316 318
ConvolutionDepthWise Conv_21                  1 1 318 319 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_22                  1 1 319 320 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_24                  1 1 320 322
ConvolutionDepthWise Conv_25                  1 1 322 323 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_26                  1 1 323 324 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_28                  1 1 324 326
Split            splitncnn_2              1 2 326 326_splitncnn_0 326_splitncnn_1
Pooling          MaxPool_29               1 1 326_splitncnn_1 327 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_30                  1 1 327 328 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_31                  1 1 328 329 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
ReLU             Relu_33                  1 1 329 331
ConvolutionDepthWise Conv_34                  1 1 331 332 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_35                  1 1 332 333 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_37                  1 1 333 335
ConvolutionDepthWise Conv_38                  1 1 335 336 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_39                  1 1 336 337 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_41                  1 1 337 339
Split            splitncnn_3              1 2 339 339_splitncnn_0 339_splitncnn_1
Pooling          MaxPool_42               1 1 339_splitncnn_1 340 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_43                  1 1 340 341 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_44                  1 1 341 342 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_46                  1 1 342 344
ConvolutionDepthWise Conv_47                  1 1 344 345 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_48                  1 1 345 346 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_50                  1 1 346 348
ConvolutionDepthWise Conv_51                  1 1 348 349 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_52                  1 1 349 350 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_54                  1 1 350 352
ConvolutionDepthWise Conv_55                  1 1 rgb_inputs 353 0=3 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27 7=3
Convolution      Conv_56                  1 1 353 354 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=192
ReLU             Relu_58                  1 1 354 356
ConvolutionDepthWise Conv_59                  1 1 356 357 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      Conv_60                  1 1 357 358 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_62                  1 1 358 360
BinaryOp         Add_63                   2 1 360 304_splitncnn_0 361 0=0
Pooling          MaxPool_64               1 1 361 362 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_65                  1 1 362 363 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      Conv_66                  1 1 363 364 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             Relu_68                  1 1 364 366
ConvolutionDepthWise Conv_69                  1 1 366 367 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Convolution      Conv_70                  1 1 367 368 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_72                  1 1 368 370
BinaryOp         Add_73                   2 1 370 313_splitncnn_0 371 0=0
Pooling          MaxPool_74               1 1 371 372 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_75                  1 1 372 373 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Convolution      Conv_76                  1 1 373 374 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             Relu_78                  1 1 374 376
ConvolutionDepthWise Conv_79                  1 1 376 377 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_80                  1 1 377 378 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_82                  1 1 378 380
ConvolutionDepthWise Conv_83                  1 1 380 381 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_84                  1 1 381 382 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_86                  1 1 382 384
BinaryOp         Add_87                   2 1 384 326_splitncnn_0 385 0=0
Pooling          MaxPool_88               1 1 385 386 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_89                  1 1 386 387 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_90                  1 1 387 388 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
ReLU             Relu_92                  1 1 388 390
ConvolutionDepthWise Conv_93                  1 1 390 391 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_94                  1 1 391 392 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_96                  1 1 392 394
ConvolutionDepthWise Conv_97                  1 1 394 395 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_98                  1 1 395 396 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_100                 1 1 396 398
BinaryOp         Add_101                  2 1 398 339_splitncnn_0 399 0=0
Pooling          MaxPool_102              1 1 399 400 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
ConvolutionDepthWise Conv_103                 1 1 400 401 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_104                 1 1 401 402 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_106                 1 1 402 404
ConvolutionDepthWise Conv_107                 1 1 404 405 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_108                 1 1 405 406 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_110                 1 1 406 408
ConvolutionDepthWise Conv_111                 1 1 408 409 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_112                 1 1 409 410 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_114                 1 1 410 412
BinaryOp         Add_115                  2 1 412 352 413 0=0
Pooling          MaxPool_116              1 1 413 414 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Interp           Resize_125               1 1 414 425 0=2 1=1.000000e+00 2=1.000000e+00 3=15 4=20 6=1
ConvolutionDepthWise Conv_126                 1 1 425 426 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_127                 1 1 426 427 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_129                 1 1 427 429
ConvolutionDepthWise Conv_130                 1 1 429 430 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_131                 1 1 430 431 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_133                 1 1 431 433
ConvolutionDepthWise Conv_134                 1 1 433 434 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_135                 1 1 434 435 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_137                 1 1 435 437
Interp           Resize_139               1 1 437 442 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=1
ConvolutionDepthWise Conv_140                 1 1 442 443 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_141                 1 1 443 444 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_143                 1 1 444 446
ConvolutionDepthWise Conv_144                 1 1 446 447 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_145                 1 1 447 448 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             Relu_147                 1 1 448 450
ConvolutionDepthWise Conv_148                 1 1 450 451 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4608 7=512
Convolution      Conv_149                 1 1 451 452 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
ReLU             Relu_151                 1 1 452 454
Interp           Resize_153               1 1 454 459 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=1
ConvolutionDepthWise Conv_154                 1 1 459 460 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_155                 1 1 460 461 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_157                 1 1 461 463
ConvolutionDepthWise Conv_158                 1 1 463 464 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_159                 1 1 464 465 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_161                 1 1 465 467
ConvolutionDepthWise Conv_162                 1 1 467 468 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
Convolution      Conv_163                 1 1 468 469 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             Relu_165                 1 1 469 471
Interp           Resize_167               1 1 471 476 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=1
ConvolutionDepthWise Conv_168                 1 1 476 477 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Convolution      Conv_169                 1 1 477 478 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_171                 1 1 478 480
ConvolutionDepthWise Conv_172                 1 1 480 481 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
Convolution      Conv_173                 1 1 481 482 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             Relu_175                 1 1 482 484
Interp           Resize_177               1 1 484 489 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=1
ConvolutionDepthWise Conv_178                 1 1 489 490 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      Conv_179                 1 1 490 491 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_181                 1 1 491 493
ConvolutionDepthWise Conv_182                 1 1 493 494 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      Conv_183                 1 1 494 y 0=6 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=384
